tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/services"
brew "autojump"
brew "awscli"
brew "bat"
brew "broot"
brew "cheat"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "dash"
brew "difftastic"
brew "etcd", restart_service: true
brew "fd"
brew "libevent"
brew "gnutls"
brew "ffmpeg"
brew "fzf"
brew "gator"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "git-town"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "gping"
brew "httpie"
brew "jid"
brew "jless"
brew "jq"
brew "lsd"
brew "mcfly"
brew "neovim"
brew "node-build"
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "unzip"
brew "vifm"
brew "yq"
brew "z"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "bettertouchtool"
cask "discord"
cask "dropbox"
cask "github"
cask "iterm2"
cask "raycast"
cask "shortcat"
cask "spotify"
cask "visual-studio-code"
vscode "akamud.vscode-theme-onedark"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "cweijan.vscode-autohotkey-plus"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "jakearl.search-editor-apply-changes"
vscode "kindy.rego"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "plex.vscode-regolint"
vscode "redhat.vscode-yaml"
vscode "sirtori.indenticator"
vscode "skattyadz.vscode-quick-scope"
vscode "sleistner.vscode-fileutils"
vscode "swellaby.workspace-config-plus"
vscode "timonwong.shellcheck"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "tsandall.opa"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wayou.vscode-todo-highlight"
