tap "1password/tap"
brew "libpng"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awscli"
brew "bat"
brew "bison"
brew "freetype"
brew "gettext"
brew "glib"
brew "cheat" # test out
brew "chezmoi"
brew "cmake"
brew "curl"
brew "gd"
brew "gmp"
brew "icu4c@76"
brew "libsodium"
brew "libzip"
brew "coreutils"
brew "dash"
brew "difftastic"
brew "dylibbundler"
brew "entr"
brew "etcd", restart_service: :changed
brew "fd" # test out
brew "libevent"
brew "gnutls"
brew "pango"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gcc@12"
brew "gh"
brew "git"
brew "git-delta"
brew "git-town"
brew "gnupg"
brew "gping" # test out
brew "httpie"
brew "imagemagick"
brew "jid"
brew "jless"
brew "jpeg"
brew "jq"
brew "libedit"
brew "libiconv"
brew "libxml2"
brew "libyaml"
brew "lsd" # test out
brew "mcfly" # test out
brew "meson"
brew "mise"
brew "zlib"
brew "mysql", restart_service: :changed
brew "neovim"
brew "pkgconf"
brew "node-build"
brew "qt@5"
brew "re2c"
brew "ripgrep"
brew "shellcheck"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "unzip"
brew "vifm"
brew "yq"
cask "1password-cli"
cask "alfred"
cask "bettertouchtool"
cask "dash"
cask "discord"
cask "dropbox"
cask "font-roboto-mono-nerd-font"
cask "github"
cask "iterm2"
cask "steam"
cask "visual-studio-code"
vscode "akamud.vscode-theme-onedark"
vscode "alexcvzz.vscode-sqlite"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmewburn.vscode-intelephense-client"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "damms005.devdb"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "jakearl.search-editor-apply-changes"
vscode "johnnymorganz.stylua"
vscode "justarandomgeek.factoriomod-debug"
vscode "laravel.vscode-laravel"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "neilbrayfield.php-docblocker"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "sirtori.indenticator"
vscode "skattyadz.vscode-quick-scope"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.vscode-zipexplorer"
vscode "sumneko.lua"
vscode "swellaby.workspace-config-plus"
vscode "timonwong.shellcheck"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wayou.vscode-todo-highlight"
vscode "xdebug.php-debug"
