# Stable
brew "bat"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-town"
brew "jid"
brew "jq"
brew "lazygit"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "shellcheck"
brew "tealdeer"
brew "tree"
brew "ugrep"
brew "unzip"
brew "yazi"
brew "zellij"
brew "zoxide"

# Libraries
brew "ast-grep"
brew "coreutils"

# Experimental
brew "entr"
brew "mcfly"
brew "gping"

# Mac OS specific stuff
tap "1password/tap"
cask "alfred"
cask "bettertouchtool"
cask "dash"
cask "discord"
cask "font-roboto-mono-nerd-font"
cask "github"
cask "iterm2"
